<template>
    <div class="agreement">
        <div class="login_msg _cus_flexContent _cus_fleAlignCen _cus_posRelative">
            <i class="login_back" @click="login_back"></i>
            <span class="colorfff _cus_posAbsolute login_sign">用户协议和隐私条款</span>
        </div>
        <div class="login_content">
            <span>
                本协议为您与此APP管理者之间所订立的契约，具有合同的法律效力。在此特别提醒您在注册成为用户之前，请认真阅读本协议。
            </span>
            <ul class="">
                <li v-for="(item,keys) in text_content" :key="keys">
                    <p>{{item.label}}</p>
                    <div class="_cus_overHidden">
                        <p v-for="(itemArr,keys) in item.content" :key="keys">{{itemArr.text}}</p>
                    </div>
                    
                </li>
            </ul>
        </div>
    </div>
</template>
<script>
    export default {
        data(){
            return {
               text_content:[
                   {
                       'label':'一、遵守法律',
                       'content':[
                           {'text':'用户同意并遵守中华人民共和国相关法律法规的所有规定，并对以任何方式使用您的账号和密码使用本服务的任何行为及其结果承担全部责任。如您的行为违反国家法律和法规的任何规定，有可能构成犯罪的，将被追究刑事责任，并由您承担全部法律责任。'}
                           ]},
                   {
                       'label':'二、本协议内容、生效、变更',
                       'content':[
                            {'text':'本协议内容包括协议正文及所有本APP已经发布的或将来有可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。如果您对协议有任何疑问，应向本APP管理者咨询。您在同意所有协议条款并完成注册程序，才能成为本APP的正式用户，您点击“我已阅读并同意本APP用户协议和法律协议”按钮后，本协议即生效，对双方产生约束力。'},
                            {'text':'只要您使用本APP平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得本APP对您问询的解答等理由，主张本协议无效，或要求撤销本协议。如果您不同意本协议的约定，您应立即停止注册程序或停止使用本APP平台服务。本APP有权根据需要不定期地制定、修改本协议各类规则，并在本APP平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用本APP平台服务。继续使用本APP平台服务的，即表明您接受修订后的协议和规则。'}
                            ]},
                   {
                       'label':'三、注册',
                       'content':[
                           {'text':'用户在使用本APP部分功能前需要注册一个账号。账号应该使用手机号码绑定注册，请用户使用尚未与本APP账号绑定的手机号码注册账号。本APP可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。注册资格用户必须具有法定的相应权限能力和行为能力的自然人、法人或其他组织，能够独立承担法律责任。您完成注册程序或其他本APP平台同意的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。'},
                           {'text':'用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、用户需承担因此引起的相应责任及后果，并且本APP保留终止用户使用本平台各项服务的权利。'},
                           {'text':'用户在本站进行浏览等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。'},
                           {'text':'注册成功后，即成为本APP平台的会员，将持有本APP平台唯一编号的账户信息，您可以根据本站规定改变您的密码。您应谨慎合理保存、使用您的会员名和密码。用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担相应连带责任。如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知本APP要求暂停相关服务，并向公安机关报案。您理解本APP对您的请求采取行动需要合理时间，本APP对在采取行动前产生的后果（包括但不限于您的任何损失）不承担任何责任。'},
                           {'text':'用户须理解并同意，本APP提供的服务，是按照现有技术和条件所能达到的现状提供的。本站点会尽最大努力向您提供服务，确保服务的连贯性和安全性，但本站点不能随时预见和防范所有风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵等原因可能导致的服务中断、数据丢失以及其他的损失和风险。'}
                       ]},
                    {
                        'label':'四、用户信息的合理使用',
                        'content':[
                            {'text':'您同意本APP平台拥有通过邮件、短信、电话等形式，向在本站注册用户发送信息等告知信息的权利。您了解并同意，本APP有权应国家司法、行政等主管部门的要求，向其提供您在本APP平台填写的注册信息等。如您涉嫌侵犯他人知识产权，则本APP有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。'}
                        ]
                    },
                    {
                        'label':'五、用户发布内容规范',
                        'content':[
                            {'text':'1、本条所述内容是指用户使用本APP的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。'},
                            {'text':'2、用户不得利用本APP账号制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：'},
                            {'text':'(1) 反对宪法所确定的基本原则的；'},
                            {'text':'(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；'},
                            {'text':'(3) 损害国家荣誉和利益的；'},
                            {'text':'(4) 煽动民族仇恨、民族歧视，破坏民族团结的；'},
                            {'text':'(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；'},
                            {'text':'(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；'},
                            {'text':'(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；'},
                            {'text':'(8) 侮辱或者诽谤他人，侵害他人合法权益的；'},
                            {'text':'(9) 含有法律、行政法规禁止的其他内容的信息。'},
                            {'text':'3、用户不得利用本APP账号或本服务制作、上载、复制、发布、传播如下干扰本APP正常运营，以及侵犯其他用户或第三方合法权益的内容：'},
                            {'text':'(1) 含有任何性或性暗示的；'},
                            {'text':'(2) 含有辱骂、恐吓、威胁内容的；'},
                            {'text':'(3) 含有骚扰、垃圾广告、恶意信息、诱骗信息的；'},
                            {'text':'(4) 涉及他人隐私、个人信息或资料的；'},
                            {'text':'(5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；'},
                            {'text':'(6) 含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。'},
                            {'text':'对违反上述承诺的用户，本APP将视情况采取拒绝发布、删除跟帖、短期禁止发言直至永久关闭账号等管理措施。对涉嫌违法犯罪的跟帖评论将保存在案、并在接受有关政府部门调查时如实报告。'}
                        ]
                    },
                    {
                        'label':'六、使用规则',
                        'content':[
                            {'text':'1、用户在本APP服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表本站点观点、立场或政策，仅代表作者自己的立场和观点，由作者本人承担一切法律责任。'},
                            {'text':'2、文字、图片、音频、视频等版权均归本APP享有或与作者共同享有，未经本APP许可，不得任意转载。'}
                        ]
                    }
               ]
            }
        },
        methods:{
            login_back(){
                this.$router.go(-1)
            }
        }
    }
</script>
<style lang="less">
    .agreement{
        width: 100%;
        background-color: #fff;
        font-size: .3rem;
        .login_msg{
        	width: 100%;
            height: 1rem;
            line-height: 1rem;
            overflow: hidden;
            background-color: #f41a14;
            .login_back{
               	width: 0.22rem;
			    height: 1rem;
			    line-height: 1rem;
			    position: absolute;
			    left: 0.2rem;
                background: url('../../../static/imgs/back.png') center center no-repeat;
                background-size: contain;
                z-index: 10;
            }
            .login_sign{
                position: absolute;
                left: 0;
                right: 0;
                margin: 0;
                top: 0;
                margin: auto;
                text-align: center;
                font-size: .32rem;
            }
        }
        .login_content{
            padding: 0 0.3rem;
            height: calc(100vh - 1rem);
            line-height: 180%;
            overflow-y: scroll;
            >span{
                display: block;
                padding: .2rem 0;
            }
            >ul{
                >li{
                    margin-bottom: 0.2rem;
                    >p{
                        margin-bottom: 0.2rem;
                        font-weight: 700;
                    }
                    >div{
                        >p{
                           text-indent: 2em; 
                        }
                    }
                }
            }
        }
    }    
</style>

